### Connecting to Postgresql

In [14]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)
Note: you may need to restart the kernel to use updated packages.

In [15]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.12/site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

In [4]:
%load_ext sql
from sqlalchemy import create_engine
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [17]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/anaconda3/lib/python3.12/site-packages (0.5.0)
Requirement already satisfied: prettytable in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (3.12.0)
Requirement already satisfied: ipython in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (8.27.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (2.0.34)
Requirement already satisfied: sqlparse in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (0.5.2)
Requirement already satisfied: six in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /opt/anaconda3/lib/python3.12/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.11.0)
Requirement already satisfied: decorator in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: pexpect>4.3 in /opt/anaconda3/lib/python3.12/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /opt/anaconda3/lib/python3.12/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /opt/anaconda3/lib/python3.12/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/anaconda3/lib/python3.12/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in /opt/anaconda3/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

In [5]:
%sql postgresql://postgres:@localhost:5432/customerdb

### 1. Customer Demographics

## Overview

### 1.1 How does customer demographics and account usage vary across different income  groups

In [19]:
%%sql SELECT 
    i.income_group_desc AS income_group,
    COUNT(c.customer_identifier) AS Total_Customers,
    ROUND(AVG(c.age)) AS Avg_Age,
    ROUND(AVG(c.number_of_accounts)) AS Avg_Number_of_Accounts
FROM 
    customers c
JOIN 
    income_group i
ON 
    c.income_group_code = i.income_group_code
GROUP BY 
    i.income_group_desc, i.income_group_code
ORDER BY 
    i.income_group_code

 * postgresql://postgres:***@localhost:5432/customerdb
22 rows affected.

[('NOT SUPPLIED', 2, Decimal('31'), Decimal('5')),
 ('R 0 - 499', 62, Decimal('36'), Decimal('8')),
 ('R500 - 999', 30, Decimal('43'), Decimal('7')),
 ('R1,000 - 1,999', 96, Decimal('54'), Decimal('7')),
 ('R2,000 - 2,999', 82, Decimal('47'), Decimal('8')),
 ('R3,000 - 3,999', 150, Decimal('40'), Decimal('8')),
 ('R4,000 - 4,999', 438, Decimal('37'), Decimal('7')),
 ('R5,000 - 5,999', 373, Decimal('36'), Decimal('8')),
 ('R6,000 - 6,999', 357, Decimal('36'), Decimal('8')),
 ('R7,000 - 7,999', 331, Decimal('36'), Decimal('9')),
 ('R8,000 - 8,999', 305, Decimal('36'), Decimal('9')),
 ('R9,000 - 9,999', 200, Decimal('37'), Decimal('9')),
 ('R10,000 - 11,999', 438, Decimal('37'), Decimal('9')),
 ('R12,000 - 14,999', 459, Decimal('38'), Decimal('10')),
 ('R15,000 - 19,999', 597, Decimal('36'), Decimal('10')),
 ('R20,000 - 24,999', 451, Decimal('37'), Decimal('10')),
 ('R25,000 - 33,999', 403, Decimal('38'), Decimal('10')),
 ('R34,000 - 41,999', 186, Decimal('38'), Decimal('11')),
 ('R42,000 - 62,999', 115, Decimal('38'), Decimal('11')),
 ('R63,000 - 84,999', 48, Decimal('40'), Decimal('12')),
 ('R85,000 - 124,999', 15, Decimal('37'), Decimal('9')),
 ('R125,000+', 6, Decimal('42'), Decimal('10'))]

### 1.2 Customers are catergorised according to their age group/life stage

In [20]:
%%sql 
SELECT 
    CASE 
        WHEN AGE < 25 THEN '16-24: Youth'
        WHEN AGE BETWEEN 25 AND 34 THEN '25-34: Young Professionals'
        WHEN AGE BETWEEN 35 AND 44 THEN '35-44: Middle-Aged Adults'
        WHEN AGE BETWEEN 45 AND 54 THEN '45-54: Prime Working Years'
        WHEN AGE BETWEEN 55 AND 64 THEN '55-64: Pre-Retirement'
        ELSE '65+: Seniors/Elderly'
    END AS age_group_label,
    COUNT(*) AS customer_count,
    ROUND(COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (), 2) AS percentage
FROM customers
GROUP BY age_group_label
ORDER BY age_group_label

 * postgresql://postgres:***@localhost:5432/customerdb
6 rows affected.

[('16-24: Youth', 578, Decimal('11.24')),
 ('25-34: Young Professionals', 1799, Decimal('34.97')),
 ('35-44: Middle-Aged Adults', 1498, Decimal('29.12')),
 ('45-54: Prime Working Years', 885, Decimal('17.20')),
 ('55-64: Pre-Retirement', 267, Decimal('5.19')),
 ('65+: Seniors/Elderly', 117, Decimal('2.27'))]

### 1.3 Customer are catergorised according to their age group/life stage and what income group they belong to

In [21]:
 %%sql
  SELECT 
    CASE 
        WHEN AGE < 25 THEN '16-24: Youth'
        WHEN AGE BETWEEN 25 AND 34 THEN '25-34: Young Professionals'
        WHEN AGE BETWEEN 35 AND 44 THEN '35-44: Middle-Aged Adults'
        WHEN AGE BETWEEN 45 AND 54 THEN '45-54: Prime Working Years'
        WHEN AGE BETWEEN 55 AND 64 THEN '55-64: Pre-Retirement'
        ELSE '65+: Seniors/Elderly'
    END AS age_group_label,
    ig.income_group_desc,
    COUNT(*) AS customer_count,
    ROUND(COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (PARTITION BY 
        CASE 
            WHEN AGE < 25 THEN '16-24: Youth'
            WHEN AGE BETWEEN 25 AND 34 THEN '25-34: Young Professionals'
            WHEN AGE BETWEEN 35 AND 44 THEN '35-44: Middle-Aged Adults'
            WHEN AGE BETWEEN 45 AND 54 THEN '45-54: Prime Working Years'
            WHEN AGE BETWEEN 55 AND 64 THEN '55-64: Pre-Retirement'
            ELSE '65+: Seniors/Elderly'
        END), 2) AS percentage_within_age_group,
    ROUND(COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (), 2) AS percentage_of_total_customers
FROM customers c
JOIN income_group ig 
    ON c.income_group_code = ig.income_group_code
GROUP BY age_group_label, 
    ig.income_group_desc,
    ig.income_group_code
ORDER BY age_group_label,
    ig.income_group_code
    Limit 10;

 * postgresql://postgres:***@localhost:5432/customerdb
10 rows affected.

[('16-24: Youth', 'NOT SUPPLIED', 1, Decimal('0.17'), Decimal('0.02')),
 ('16-24: Youth', 'R 0 - 499', 14, Decimal('2.42'), Decimal('0.27')),
 ('16-24: Youth', 'R500 - 999', 4, Decimal('0.69'), Decimal('0.08')),
 ('16-24: Youth', 'R1,000 - 1,999', 7, Decimal('1.21'), Decimal('0.14')),
 ('16-24: Youth', 'R2,000 - 2,999', 7, Decimal('1.21'), Decimal('0.14')),
 ('16-24: Youth', 'R3,000 - 3,999', 18, Decimal('3.11'), Decimal('0.35')),
 ('16-24: Youth', 'R4,000 - 4,999', 68, Decimal('11.76'), Decimal('1.32')),
 ('16-24: Youth', 'R5,000 - 5,999', 56, Decimal('9.69'), Decimal('1.09')),
 ('16-24: Youth', 'R6,000 - 6,999', 53, Decimal('9.17'), Decimal('1.03')),
 ('16-24: Youth', 'R7,000 - 7,999', 44, Decimal('7.61'), Decimal('0.86'))]

### 1.4 How does the number of accounts owned by a customer relate to their transaction behavior in terms of count and total amount

In [23]:
%%sql

SELECT
    c.number_of_accounts,
    COUNT(t.transaction_id) AS transaction_count,
    ROUND(SUM(t.amt)) AS total_amount
FROM customers c
JOIN transactions t ON c.customer_identifier = t.customer_identifier
GROUP BY c.number_of_accounts
ORDER BY c.number_of_accounts;

 * postgresql://postgres:***@localhost:5432/customerdb
31 rows affected.

[(2, 1296, 82709.0),
 (3, 6830, 208634.0),
 (4, 19690, 875208.0),
 (5, 40811, 1226795.0),
 (6, 59643, 1478617.0),
 (7, 72220, 1103983.0),
 (8, 88935, 1309127.0),
 (9, 78185, 1005855.0),
 (10, 74680, 1022493.0),
 (11, 72233, 694649.0),
 (12, 66204, 431259.0),
 (13, 54656, 393727.0),
 (14, 46333, 254888.0),
 (15, 27689, 191446.0),
 (16, 30226, 136864.0),
 (17, 35580, -83546.0),
 (18, 17527, 111901.0),
 (19, 16869, -21889.0),
 (20, 9624, 30098.0),
 (21, 7087, 11940.0),
 (22, 7038, 47689.0),
 (23, 3158, 17484.0),
 (24, 3858, -7114.0),
 (25, 2234, -3075.0),
 (26, 271, 31.0),
 (27, 2009, 4054.0),
 (28, 786, -16227.0),
 (29, 906, -18682.0),
 (30, 168, 7828.0),
 (34, 644, 1944.0),
 (38, 154, 183.0)]

### 1.5 Active vs Inactive customers

In [7]:
%%sql 
SELECT 
    customer_status, 
    COUNT(*) AS customer_count, 
    ROUND(100.0 * COUNT(*) / (SELECT COUNT(*) FROM customers), 2) AS percentage
FROM (
    SELECT 
        c.customer_identifier,
        CASE 
            WHEN t.last_transaction_date >= '2022-03-01' THEN 'Active'
            ELSE 'Inactive'
        END AS customer_status
    FROM 
        customers c
    LEFT JOIN (
        SELECT 
            customer_identifier, 
            MAX(record_date) AS last_transaction_date
        FROM 
            transactions
        GROUP BY 
            customer_identifier
    ) t
    ON c.customer_identifier = t.customer_identifier
) sub
GROUP BY customer_status;

 * postgresql://postgres:***@localhost:5432/customerdb
2 rows affected.

[('Active', 4794, Decimal('93.20')), ('Inactive', 350, Decimal('6.80'))]